Revit 2027 API
ElementTransformUtils.CanMirrorElement Method
 Determines whether element can be mirrored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanMirrorElement(
	Document ADoc,
	ElementId elemId
)
Public Shared Function CanMirrorElement (
	ADoc As Document,
	elemId As ElementId
) As Boolean
public:
static bool CanMirrorElement(
	Document^ ADoc,
	ElementId^ elemId
)
static member CanMirrorElement :
        ADoc : Document *
        elemId : ElementId -> bool
Parameters
ADoc Document
 The document where the element reside.
elemId ElementId
 The element identified by id.
Return Value
Boolean
 True if the element can be mirrored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementTransformUtils Class
Autodesk.Revit.DB Namespace